УчебныеПроекты/src/Documents/ПродажаТоваров/ПродажаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаТоваров</name>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <registerRecords>AccumulationRegister.ПродажаТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ВедомостьПоТоварам</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договора</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделение</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.Серии</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидыЦен</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УчебныеПроекты/src/Documents/ПродажаТоваров/Forms/ФормаДокумента/Module.bsl
&НаСервереБезКонтекста
Процедура ТоварыВидыЦенПриИзмененииНаСервере(ВидыЦен,Номенклатура, Цена)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЦеныПоВидамЦенСрезПервых.Цена,
		|	ЦеныПоВидамЦенСрезПервых.Товары,
		|	ЦеныПоВидамЦенСрезПервых.ВидыЦен
		|ИЗ
		|	РегистрСведений.ЦеныПоВидамЦен.СрезПоследних КАК ЦеныПоВидамЦенСрезПервых
		|ГДЕ
		|	ЦеныПоВидамЦенСрезПервых.Товары = &Номенклатура
		|	И ЦеныПоВидамЦенСрезПервых.ВидыЦен = &ВидыЦен";
	
	Запрос.УстановитьПараметр("ВидыЦен", ВидыЦен);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если РезультатЗапроса.Пустой() Тогда
		Цена = 0;
	Иначе
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Цена = ВыборкаДетальныеЗаписи.Цена;
		КонецЦикла;	
	КонецЕсли;
	

	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВидыЦенПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ТоварыВидыЦенПриИзмененииНаСервере(ТекСтрока.ВидыЦен, ТекСтрока.Номенклатура, ТекСтрока.Цена);
	ТоварыЦенаПриИзменении(Элемент);
КонецПроцедуры



&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма");
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ТоварыНоменклатураПриИзмененииНаСервере(Номенклатура, Цена, ЕдиницаИзмерения)
	Цена = Номенклатура.ЦенаПокупки;
	ЕдиницаИзмерения = Номенклатура.ЕдиницаИзмерений;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;	
	ТоварыНоменклатураПриИзмененииНаСервере(ТекСтрока.Номенклатура, ТекСтрока.Цена, ТекСтрока.ЕдиницаИзмерения);
	ТоварыЦенаПриИзменении(Элемент);
КонецПроцедуры


&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	//TODO: Вставить содержимое обработчика
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ТекСтрока.Сумма = ТекСтрока.Количество * ТекСтрока.Цена;
	ТоварыСуммаПриИзменении(Элемент);
КонецПроцедуры
